<template>
  <div class="about">
    <div class="post">
      <h1 class="entry-title">Играй в судоку прямо сейчас!</h1>
      <div class="entry-content">
        <p>
          Судоку – это одна из самых популярных игр-головоломок всех времен. Цель судоку – заполнить сетку 9 на 9 цифрами так, чтобы в каждой строке, столбце и сетке 3 на 3 были все цифры от 1 до 9. Судоку – не только логическая головоломка, но и отличная игра для развития мозга. Если ты будешь играть в судоку каждый день, то вскоре увидишь, как твоя способность сосредотачиваться и мыслительная способность увеличиваются. Начни играть в судоку прямо сейчас, и совсем скоро этот пазл станет твоей любимой онлайн-игрой.
        </p>
      </div>
    </div>
    <div class="post">
      <h2 class="entry-title">О судоку</h2>
      <div class="entry-content">
        <p>
          Популярная японская игра-головоломка судоку основана на логическом расположении цифр. Судоку – это онлайн-игра на логику, которая не требует вычислений или же особых математических навыков. Все, что тебе потребуется – твой мозг и умение сосредотачиваться.
          </p>
        </div>
      </div>
  </div>
</template>
