<template>
  <div class="how-to-play">
    <div class="jumbotron m-0 jumbotron-fluid">
      <h2 class="display-4">Как играть в судоку</h2>
      <div class="container">
        <p>
          Цель судоку – заполнить сетку n²×n² цифрами, чтобы в каждом столбце, строке и сетке n×n были цифры от 1 до n². В начале игры некоторые ячейки сетки n²×n² будут заполнены. Ваша задача – вписать недостающие цифры и заполнить всю сетку при помощи логики. Не забудьте, ход будет неверным, если:
        </p>
        <ul>
          <li>Любая строка содержит дублирующиеся цифры от 1 до n²</li>
          <li>Любой столбец содержит дублирующиеся цифры от 1 до n²</li>
          <li>Любая сетка n×n содержит дублирующиеся цифры от 1 до n²</li>
        </ul>
      </div>
      <h2 class="display-4">Подсказки по игре</h2>
      <div class="container">
        <p>
          Судоку станет веселой игрой-головоломкой, как только ты поймешь, что к чему. В то же время учиться играть в судоку для новичков иногда бывает сложно. Так что если ты – полный новичок, вот несколько подсказок, которые помогут тебе улучшить свои навыки игры.
        </p>
        <ul>
          <li>
            Подсказка 1: ищи строки, столбцы и сетки n на n, где есть 5 цифр или больше. Проверь оставшиеся пустые клетки, попробовав неиспользованные цифры. Во многих случая ты обнаружишь цифры, которые можно написать только в одной клетке, потому что остальные цифры уже содержатся в этой строке, столбце или сетке n на n.
          </li>
          <li>
            Подсказка 2: визуально разбей сетку на n столбца и n строки. В каждом столбце и каждой строке будет n сетки n на n. А теперь ищи строки или столбцы, где есть 2 одинаковых цифры. Логично, что в оставшейся сетке из n² клеток должна быть третья копия этой цифры. Посмотри на n² оставшихся позиций, чтобы найти место для недостающей цифры.<br>
          </li>
        </ul>
      </div>
    </div>
  </div>
</template>
