<template>
  <div class="how-to-play">
    <div class="post">
      <h2 class="entry-title">Как играть в судоку</h2>
      <div class="entry-content">
        <p>
          Цель судоку – заполнить сетку 9×9 цифрами, чтобы в каждом столбце, строке и сетке 3×3 были цифры от 1 до 9. В начале игры некоторые ячейки сетки 9×9 будут заполнены. Ваша задача – вписать недостающие цифры и заполнить всю сетку при помощи логики. Не забудьте, ход будет неверным, если:
        </p>
        <ul>
          <li>Любая строка содержит дублирующиеся цифры от 1 до 9</li>
          <li>Любой столбец содержит дублирующиеся цифры от 1 до 9</li>
          <li>Любая сетка 3×3 содержит дублирующиеся цифры от 1 до 9</li>
        </ul>
      </div>
    </div>
    <div class="post">
      <h2 class="entry-title">Подсказки по игре</h2>
      <div class="entry-content">
        <p>
          Судоку станет веселой игрой-головоломкой, как только ты поймешь, что к чему. В то же время учиться играть в судоку для новичков иногда бывает сложно. Так что если ты – полный новичок, вот несколько подсказок, которые помогут тебе улучшить свои навыки игры.
        </p>
        <ul>
          <li>
            Подсказка 1: ищи строки, столбцы и сетки 3 на 3, где есть 5 цифр или больше. Проверь оставшиеся пустые клетки, попробовав неиспользованные цифры. Во многих случая ты обнаружишь цифры, которые можно написать только в одной клетке, потому что остальные цифры уже содержатся в этой строке, столбце или сетке 3 на 3.
          </li>
          <li>
            Подсказка 2: визуально разбей сетку на 3 столбца и 3 строки. В каждом столбце и каждой строке будет 3 сетки 3 на 3. А теперь ищи строки или столбцы, где есть 2 одинаковых цифры. Логично, что в оставшейся сетке из 9 клеток должна быть третья копия этой цифры. Посмотри на 9 оставшихся позиций, чтобы найти место для недостающей цифры.<br>
          </li>
        </ul>
      </div>
    </div>
  </div>
</template>
